In [1]:
import pandas as pd

In [2]:
cars = pd.read_csv('mtcars.csv')

In [3]:
cars.head()

,car_model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [4]:
X = cars.loc[:,['hp','wt','am','carb']]
y = cars.mpg

In [5]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [6]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=15)

In [7]:
y_train.shape

(25,)

In [8]:
model = LinearRegression()

In [9]:
model.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [10]:
y_predict = model.predict(X_test)

In [11]:
y_predict

array([20.62674166, 23.34343047, 16.80801325, 10.22384293, 11.24548849,
       29.22556322, 28.66518904])

In [12]:
y_test

29    19.7
20    21.5
24    19.2
16    14.7
14    10.4
18    30.4
19    33.9
Name: mpg, dtype: float64

In [13]:
from sklearn.metrics import r2_score

In [14]:
r2_score(y_test, y_predict)

0.8551594943283269

In [15]:
hp_data = pd.read_csv('hp_data.csv')

In [16]:
hp_data.head()

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
enc = LabelEncoder()

In [19]:
enc.fit(hp_data.place)

LabelEncoder()

In [20]:
enc.classes_

array(['Abbaiah Reddy Layout', 'Ambalipura', 'BTM Layout',
       'Devarabeesana Halli', 'Electronics City Phase 1', 'Frazer Town',
       'Gunjur', 'KR Puram', 'Malleshwaram', 'Rajaji Nagar',
       'Sarakki Nagar', 'Subramanyapura', 'Whitefield', 'Yelachenahalli',
       'Yelahanka'], dtype=object)

In [21]:
hp_data.place = enc.transform(hp_data.place )

In [22]:
hp_data.head()

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,2,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,14,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,12,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,1,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,14,Super built-up Area,2190,Resale,5,3,5,3